In [4]:
import pandas as pd
dfg=pd.read_csv("onlineFile.csv")

In [5]:
g=dfg.groupby("Pclass")

In [7]:
g.max(numeric_only=True)

        PassengerId  Survived   Age  SibSp  Parch      Fare
Pclass
1               890         1  80.0      3      4  512.3292
2               887         1  70.0      3      3   73.5000
3               891         1  74.0      8      6   69.5500

In [9]:
g.max(numeric_only=True).T

Pclass              1      2       3
PassengerId  890.0000  887.0  891.00
Survived       1.0000    1.0    1.00
Age           80.0000   70.0   74.00
SibSp          3.0000    3.0    8.00
Parch          4.0000    3.0    6.00
Fare         512.3292   73.5   69.55

In [27]:
date=(
    {
        "key1":[1,2,3,4,5,6],
        "key2":[4,5,6,7,8,9],
        "key3":[9,8,7,6,5,4]
 }
)

In [28]:
date2=(
    {
        "key1":[1,22,3,4,55,6],
        "key4":[4,5,6,7,8,96],
        "key5":[9,8,7,6,5,4]
 }
)

In [29]:
dt1=pd.DataFrame(date)

In [30]:
dt2=pd.DataFrame(date2)

In [31]:
date

{'key1': [1, 2, 3, 4, 5, 6],
 'key2': [4, 5, 6, 7, 8, 9],
 'key3': [9, 8, 7, 6, 5, 4]}

In [32]:
date2

{'key1': [1, 22, 3, 4, 55, 6],
 'key4': [4, 5, 6, 7, 8, 96],
 'key5': [9, 8, 7, 6, 5, 4]}

In [33]:
pd.merge(dt1,dt2)

   key1  key2  key3  key4  key5
0     1     4     9     4     9
1     3     6     7     6     7
2     4     7     6     7     6
3     6     9     4    96     4